uhnp/src/Reports/СтрессТестПроцентногоРиска/СтрессТестПроцентногоРиска.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>СтрессТестПроцентногоРиска</name>
</mdclass:Report>

uhnp/src/InformationRegisters/ВерсииГрафиковРасчетов/ВерсииГрафиковРасчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВерсииГрафиковРасчетов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ОпорныйГрафик</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>План</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВерсияГрафика</name>
    <type>
      <types>DefinedType.ВерсияГрафика</types>
    </type>
  </resources>
  <dimensions>
    <name>ПредметГрафика</name>
    <type>
      <types>DefinedType.ПредметГрафика</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/AccumulationRegisters/РасчетыСКонтрагентамиГрафики/РасчетыСКонтрагентамиГрафики.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасчетыСКонтрагентамиГрафики</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <attributes>
    <name>СтатьяБюджета</name>
    <type>
      <types>DefinedType.СтатьиБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриходРасход</name>
    <type>
      <types>EnumRef.ВидыДвиженийПриходРасход</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаПлатежа</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПлатежа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КурсПлатежа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьПлатежа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика1</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика2</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика3</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика4</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика5</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика6</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦФО</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидБюджета</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Операция</name>
    <comment>Операция графика</comment>
    <type>
      <types>CatalogRef.ОперацииГрафиковДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетОрганизации</name>
    <type>
      <types>DefinedType.БанковскийСчетОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетКонтрагента</name>
    <type>
      <types>DefinedType.БанковскийСчетКонтрагента</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументРегистратор</name>
    <type>
      <types>DefinedType.РегистрацияДанныхБюджетированияСсылки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговораУХ</name>
    <type>
      <types>CatalogRef.ВидыДоговоровКонтрагентовУХ</types>
    </type>
  </attributes>
  <attributes>
    <name>БезакцептноеСписание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ВерсияГрафика</name>
    <type>
      <types>DefinedType.ВерсияГрафика</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПредметГрафика</name>
    <type>
      <types>DefinedType.ПредметГрафика</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭлементСтруктурыЗадолженности</name>
    <type>
      <types>EnumRef.ЭлементыСтруктурыЗадолженности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

uhnp/src/InformationRegisters/НастройкиФинансовыхИнструментов/НастройкиФинансовыхИнструментов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиФинансовыхИнструментов</name>
  <resources>
    <name>СтатьяБюджета</name>
    <type>
      <types>Characteristic.ВидыБюджетов</types>
    </type>
  </resources>
  <dimensions>
    <name>Операция</name>
    <type>
      <types>CatalogRef.ОперацииГрафиковДоговоров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/ТипыСтавокДляРасчетаПериодическихОпераций/ТипыСтавокДляРасчетаПериодическихОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСтавокДляРасчетаПериодическихОпераций</name>
  <enumValues>
    <name>Фиксированная</name>
  </enumValues>
  <enumValues>
    <name>Дифференцированная</name>
  </enumValues>
  <enumValues>
    <name>Плавающая</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Reports/СтрессТестПроцентногоРиска/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	// Возращает значение параметра СКД с именем НаименованиеПараметраВход
Функция ПолучитьЗначениеПараметраСКД(НаименованиеПараметраВход)
	РезультатФункции = Неопределено;
	ЭлементыОтбора = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы;
	// Найдем настройку и запомним её GUID.
	ЭлементыОтбора = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы;
	ИдентификаторНастройки = "----";
	Для Каждого ТекЭлементыОтбора Из ЭлементыОтбора Цикл
		Если Строка(ТекЭлементыОтбора.Параметр) = НаименованиеПараметраВход Тогда
			ИдентификаторНастройки = ТекЭлементыОтбора.ИдентификаторПользовательскойНастройки;
		КонецЕсли;
	КонецЦикла;
	// Получим значение найденной настройки.
	ЭлементыОтбора = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;
	Для Каждого ТекЭлементыОтбора Из ЭлементыОтбора Цикл
		Если ТекЭлементыОтбора.ИдентификаторПользовательскойНастройки = ИдентификаторНастройки Тогда
			РезультатФункции = ТекЭлементыОтбора.Значение;
		Иначе
			//Ничего не делаем
		КонецЕсли;
	КонецЦикла;
	// Преобразование выходных данных.
	Если ТипЗнч(РезультатФункции) = Тип("СтандартнаяДатаНачала") Тогда
		РезультатФункции = РезультатФункции.Дата;
	Иначе
		// Не требуется преобразование.
	КонецЕсли;
	Возврат РезультатФункции;	
КонецФункции

// Возвращает таблицу начальных условий для расчета плавающих курсов.
Функция ПолучитьТаблицуНачальныхУсловий()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВерсииРасчетовСрезПоследних.Период КАК Период,
		|	ВерсииРасчетовСрезПоследних.Регистратор КАК Регистратор,
		|	ВерсииРасчетовСрезПоследних.ПредметГрафика КАК ПредметГрафика,
		|	ВерсииРасчетовСрезПоследних.Организация КАК Организация,
		|	ВерсииРасчетовСрезПоследних.ОпорныйГрафик КАК ОпорныйГрафик,
		|	ВерсииРасчетовСрезПоследних.План КАК План
		|ПОМЕСТИТЬ ВТ_ВерсииГрафиков
		|ИЗ
		|	РегистрСведений.ВерсииГрафиковРасчетов.СрезПоследних КАК ВерсииРасчетовСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РасчетыСКонтрагентамиГрафики.Регистратор КАК Регистратор,
		|	РасчетыСКонтрагентамиГрафики.ПредметГрафика КАК ПредметГрафика,
		|	РасчетыСКонтрагентамиГрафики.Период КАК ДатаОперации,
		|	СУММА(РасчетыСКонтрагентамиГрафики.Сумма) КАК Сумма,
		|	РасчетыСКонтрагентамиГрафики.СтатьяБюджета КАК СтатьяБюджета,
		|	РасчетыСКонтрагентамиГрафики.Валюта КАК Валюта
		|ПОМЕСТИТЬ ВТ_ИндитикативныеСтавки
		|ИЗ
		|	РегистрНакопления.РасчетыСКонтрагентамиГрафики КАК РасчетыСКонтрагентамиГрафики
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВерсииГрафиков КАК ВТ_ВерсииГрафиков
		|		ПО РасчетыСКонтрагентамиГрафики.ПредметГрафика = ВТ_ВерсииГрафиков.ПредметГрафика
		|ГДЕ
		|	ЕСТЬNULL(ВТ_ВерсииГрафиков.Регистратор.ТипПроцентнойСтавки, ЗНАЧЕНИЕ(Перечисление.ТипыСтавокДляРасчетаПериодическихОпераций.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ТипыСтавокДляРасчетаПериодическихОпераций.Плавающая)
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыСКонтрагентамиГрафики.Период,
		|	РасчетыСКонтрагентамиГрафики.ПредметГрафика,
		|	РасчетыСКонтрагентамиГрафики.Регистратор,
		|	РасчетыСКонтрагентамиГрафики.СтатьяБюджета,
		|	РасчетыСКонтрагентамиГрафики.Валюта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВТ_ИндитикативныеСтавки.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ ВТ_ОтборДаты
		|ИЗ
		|	ВТ_ИндитикативныеСтавки КАК ВТ_ИндитикативныеСтавки
		|ГДЕ
		|	ВТ_ИндитикативныеСтавки.ДатаОперации МЕЖДУ &ДатаНачала И &ДатаОкончания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ИндитикативныеСтавки.Регистратор КАК Регистратор,
		|	ВТ_ИндитикативныеСтавки.ПредметГрафика КАК ПредметГрафика,
		|	ВТ_ИндитикативныеСтавки.ДатаОперации КАК ДатаОперации,
		|	СУММА(ВТ_ИндитикативныеСтавки.Сумма) КАК Сумма,
		|	ВТ_ИндитикативныеСтавки.Валюта КАК Валюта
		|ИЗ
		|	ВТ_ИндитикативныеСтавки КАК ВТ_ИндитикативныеСтавки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ОтборДаты КАК ВТ_ОтборДаты
		|		ПО ВТ_ИндитикативныеСтавки.Регистратор = ВТ_ОтборДаты.Регистратор
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиФинансовыхИнструментов КАК НастройкиФинансовыхИнструментов
		|		ПО ВТ_ИндитикативныеСтавки.СтатьяБюджета = НастройкиФинансовыхИнструментов.СтатьяБюджета
		|ГДЕ
		|	НастройкиФинансовыхИнструментов.Операция В(&ПараметрыФИ)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ИндитикативныеСтавки.Регистратор,
		|	ВТ_ИндитикативныеСтавки.ПредметГрафика,
		|	ВТ_ИндитикативныеСтавки.ДатаОперации,
		|	ВТ_ИндитикативныеСтавки.Валюта";
	ПараметрыФИ = Новый Массив;
	ПараметрыФИ.Добавить(Справочники.ОперацииГрафиковДоговоров.КредитПолученный_ОсновнойДолгПолучение);
	ДатаНачала		 = ПолучитьЗначениеПараметраСКД("ДатаНачала");
	ДатаОкончания	 = ПолучитьЗначениеПараметраСКД("ДатаОкончания");
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);		
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);	
	Запрос.УстановитьПараметр("ПараметрыФИ", ПараметрыФИ);
	РезультатЗапроса = Запрос.Выполнить();
	РезультатФункции = РезультатЗапроса.Выгрузить();		
	Возврат РезультатФункции;
КонецФункции

// Увеличивает все ставки в таблице процентных периодов ИсходнаяТаблицаВход 
// на КоэффициентВход и возвращает таблицу сумм по полученным процентам для
// параметров расчета СтруктураПараметровРасчетаВход.
Функция ПолучитьТаблицуПроцентовПоКоэффициенту(ИсходнаяТаблицаВход, КоэффициентВход, Знач СтруктураПараметровРасчетаВход)
	// Скопируем таблицу и увеличим процентные ставки.
	ТаблицаИзмененныхКоэффициентов = Новый ТаблицаЗначений;
	ТаблицаИзмененныхКоэффициентов.Колонки.Добавить("Дата");
	ТаблицаИзмененныхКоэффициентов.Колонки.Добавить("ПроцентнаяСтавка");
	ЗаполненаМаксСтавка = ЗначениеЗаполнено(СтруктураПараметровРасчетаВход.ПлавающаяСтавкаМаксимум);
	ЗаполненаМинСтавка = ЗначениеЗаполнено(СтруктураПараметровРасчетаВход.ПлавающаяСтавкаМинимум);
	УстановленКоридорСтавок = ЗаполненаМинСтавка ИЛИ ЗаполненаМаксСтавка;
	Для Каждого ТекИсходнаяТаблицаВход Из ИсходнаяТаблицаВход Цикл
		НоваяСтрока = ТаблицаИзмененныхКоэффициентов.Добавить();
		НоваяСтрока.Дата = ТекИсходнаяТаблицаВход.ДатаНачисления;
		Если УстановленКоридорСтавок Тогда
			// Есть коридор. Проверим, что измененная ставка не входит в него, при необходимости - скорректируем.
			НоваяСтавка = ТекИсходнаяТаблицаВход.ПроцентнаяСтавка + КоэффициентВход;
			Если НоваяСтавка < СтруктураПараметровРасчетаВход.ПлавающаяСтавкаМинимум Тогда
				НоваяСтрока.ПроцентнаяСтавка = СтруктураПараметровРасчетаВход.ПлавающаяСтавкаМинимум;
			Иначе
				НоваяСтрока.ПроцентнаяСтавка = НоваяСтавка;
			КонецЕсли;
			Если НоваяСтавка > СтруктураПараметровРасчетаВход.ПлавающаяСтавкаМаксимум Тогда
				НоваяСтрока.ПроцентнаяСтавка = СтруктураПараметровРасчетаВход.ПлавающаяСтавкаМаксимум;
			Иначе
				НоваяСтрока.ПроцентнаяСтавка = НоваяСтавка;
			КонецЕсли;
		Иначе
			НоваяСтрока.ПроцентнаяСтавка = ТекИсходнаяТаблицаВход.ПроцентнаяСтавка + КоэффициентВход;
		КонецЕсли;
	КонецЦикла;
	// Получим таблицу сумм процентов по новой таблице процентов.
	СтруктураПараметровРасчетаВход.РучноеУправлениеИзменениямиСтавки = Истина;
	СтруктураПараметровРасчетаВход.ПроцентныеСтавки = ТаблицаИзмененныхКоэффициентов;
	ТаблицаСумм = ФинансоваяМатематика.ПолучитьТаблицуПроцентов(СтруктураПараметровРасчетаВход);
	// Добавим колонку Месяц.
	ТаблицаСумм.Колонки.Добавить("Месяц");
	Для Каждого ТекТаблицаСумм Из ТаблицаСумм Цикл
		ТекТаблицаСумм.Месяц = НачалоМесяца(ТекТаблицаСумм.ДатаНачисления);
	КонецЦикла;
	Возврат ТаблицаСумм;
КонецФункции

// Возвращает массив коэффициентов ставок для тестирования.
Функция ПолучитьМассивКоэффициентов()
	РезультатФункции = Новый Массив;
	ИнтервалИзмененияСтавки = ПолучитьЗначениеПараметраСКД("ИнтервалИзмененияСтавки");
	РезультатФункции.Добавить(-3 * ИнтервалИзмененияСтавки);
	РезультатФункции.Добавить(-2 * ИнтервалИзмененияСтавки);
	РезультатФункции.Добавить(-1 * ИнтервалИзмененияСтавки);
	РезультатФункции.Добавить(0);                                 // Нейтральная запись.
	РезультатФункции.Добавить(1 * ИнтервалИзмененияСтавки);
	РезультатФункции.Добавить(2 * ИнтервалИзмененияСтавки);
	РезультатФункции.Добавить(3 * ИнтервалИзмененияСтавки);
	Возврат РезультатФункции;
КонецФункции

// Добавляет значения из таблицы ТаблицаПроцентовПоКоэффициентуВход в таблицу ТаблицаРасчетаВход. 
Процедура ПеренестиТаблицуПроцентовВТаблицуРасчетов(ТаблицаРасчетаВход, ТаблицаПроцентовПоКоэффициентуВход, СтруктураПараметровТестированияВход)
	ДатаНачала		 = ПолучитьЗначениеПараметраСКД("ДатаНачала");
	ДатаОкончания	 = ПолучитьЗначениеПараметраСКД("ДатаОкончания");
	Коэффициент						 = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураПараметровТестированияВход, "Коэффициент", 0);
	Организация						 = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураПараметровТестированияВход, "Организация", Справочники.Организации.ПустаяСсылка());
	СоответствиеПоискаИсходныхСумм	 = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураПараметровТестированияВход, "СоответствиеПоискаИсходныхСумм", Новый Соответствие);
	Валюта							 = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураПараметровТестированияВход, "Валюта", Справочники.Валюты.ПустаяСсылка());
	ИндикативнаяСтавка				 = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураПараметровТестированияВход, "ИндикативнаяСтавка", Справочники.ВидыКотировокФинансовыхИнструментов.ПустаяСсылка());
	Для Каждого ТекТаблицаПроцентовПоКоэффициенту Из ТаблицаПроцентовПоКоэффициентуВход Цикл
		Если (ТекТаблицаПроцентовПоКоэффициенту.Месяц >= ДатаНачала) И  (ТекТаблицаПроцентовПоКоэффициенту.Месяц <= ДатаОкончания) Тогда
			НоваяСтрокаТаблицаРасчета = ТаблицаРасчетаВход.Добавить();
			НоваяСтрокаТаблицаРасчета.Период				 = ТекТаблицаПроцентовПоКоэффициенту.Месяц;
			НоваяСтрокаТаблицаРасчета.Сумма					 = ТекТаблицаПроцентовПоКоэффициенту.Сумма;
			НоваяСтрокаТаблицаРасчета.Коэффициент			 = Коэффициент;
			НоваяСтрокаТаблицаРасчета.Организация			 = Организация;
			НоваяСтрокаТаблицаРасчета.ИндикативнаяСтавка	 = ИндикативнаяСтавка;
			НоваяСтрокаТаблицаРасчета.Валюта				 = Валюта;
			НайденноеЗначение = СоответствиеПоискаИсходныхСумм[ТекТаблицаПроцентовПоКоэффициенту.Месяц];
			Если НайденноеЗначение <> Неопределено Тогда
				НоваяСтрокаТаблицаРасчета.ИсходнаяСумма = НайденноеЗначение;
			Иначе
				НоваяСтрокаТаблицаРасчета.ИсходнаяСумма = 0;
			КонецЕсли;
		Иначе
			// Запись не входит в рассматриваемый период. Не добавляем её.
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Возвращает таблицу для передачи в СКД.
Функция ПолучитьТаблицуРасчета()
	// Инициализация.
	МассивКоэффициентов = ПолучитьМассивКоэффициентов();
	ТаблицаРасчета = Новый ТаблицаЗначений;
	ТаблицаРасчета.Колонки.Добавить("Период");
	ТаблицаРасчета.Колонки.Добавить("Коэффициент");
	ТаблицаРасчета.Колонки.Добавить("Сумма");
	ТаблицаРасчета.Колонки.Добавить("ИсходнаяСумма");
	ТаблицаРасчета.Колонки.Добавить("Организация");
	ТаблицаРасчета.Колонки.Добавить("Валюта");
	ТаблицаРасчета.Колонки.Добавить("ИндикативнаяСтавка");
	// Получение таблицы начальных условий и её обход.
	ТаблицаНачальныхУсловий = ПолучитьТаблицуНачальныхУсловий();
	ОписаниеГрафикаКредит = Документы.ВерсияСоглашенияКредит.ОписаниеГрафика(Справочники.ВидыДоговоровКонтрагентовУХ.Кредит);
	Для Каждого ТекТаблицаНачальныхУсловий Из ТаблицаНачальныхУсловий Цикл
		ТекРегистратор = ТекТаблицаНачальныхУсловий.Регистратор;
		ТекОрганизация = ТекТаблицаНачальныхУсловий.ПредметГрафика.Организация;
		Если (ЗначениеЗаполнено(ТекРегистратор)) И (ТипЗнч(ТекРегистратор) = Тип("ДокументСсылка.ВерсияСоглашенияКредит")) Тогда
			// Получение исходной таблицы процентов.
			ДокументОбъект = ТекРегистратор.ПолучитьОбъект();
			СтруктураПараметровРасчета = ДокументОбъект.ПараметрыРасчетаСекции("Проценты", ОписаниеГрафикаКредит);
			ИсходнаяТаблицаПроцентныхПериодов = ФинансоваяМатематика.ПолучитьТаблицуПроцентныхПериодов(СтруктураПараметровРасчета, Ложь);
			ТаблицаПроцентовИсходная = ПолучитьТаблицуПроцентовПоКоэффициенту(ИсходнаяТаблицаПроцентныхПериодов, 0, СтруктураПараметровРасчета);     // Значение исходных сумм с нулевым коэффициентом сдвига.
			ТаблицаПроцентовИсходная.Свернуть("Месяц", "Сумма");
			СоответствиеПоискаИсходныхСумм = Новый Соответствие;
			Для Каждого ТекТаблицаПроцентовИсходная Из ТаблицаПроцентовИсходная Цикл
				СоответствиеПоискаИсходныхСумм.Вставить(ТекТаблицаПроцентовИсходная.Месяц, ТекТаблицаПроцентовИсходная.Сумма);
			КонецЦикла;
			// Получение данных для изменной таблицы процентов по каждому из коэффициентов.
			Для Каждого ТекМассивКоэффициентов Из МассивКоэффициентов Цикл
				ТаблицаПроцентовПоКоэффициенту = ПолучитьТаблицуПроцентовПоКоэффициенту(ИсходнаяТаблицаПроцентныхПериодов, ТекМассивКоэффициентов, СтруктураПараметровРасчета);
				ТаблицаПроцентовПоКоэффициенту.Свернуть("Месяц", "Сумма");
				// Вывод данных в итоговую таблицу.
				СтруктураПараметровТестирования = Новый Структура;
				СтруктураПараметровТестирования.Вставить("Коэффициент", ТекМассивКоэффициентов);
				СтруктураПараметровТестирования.Вставить("Организация", ТекОрганизация);
				СтруктураПараметровТестирования.Вставить("СоответствиеПоискаИсходныхСумм", 	СоответствиеПоискаИсходныхСумм);
				СтруктураПараметровТестирования.Вставить("Валюта", 							ТекТаблицаНачальныхУсловий.Валюта);
				СтруктураПараметровТестирования.Вставить("ИндикативнаяСтавка", 				ТекРегистратор.ИндикативнаяСтавка);
				ПеренестиТаблицуПроцентовВТаблицуРасчетов(ТаблицаРасчета, ТаблицаПроцентовПоКоэффициенту, СтруктураПараметровТестирования);
			КонецЦикла;
		Иначе
			Продолжить;			// Не рассматриваем прочие фин инструменты.
		КонецЕсли;
	КонецЦикла;
	// Свёртка и вывод итоговых данных.
	ТаблицаРасчета.Свернуть("Период, Коэффициент, Организация, Валюта, ИндикативнаяСтавка", "Сумма, ИсходнаяСумма");
	Возврат ТаблицаРасчета;
КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТаблицаРасчета = ПолучитьТаблицуРасчета();
 	ВНД = Новый Структура("ТЗ_Проценты", ТаблицаРасчета);
	СтандартнаяОбработка = Ложь;
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВНД, ДанныеРасшифровки, Истина);
	ДокументРезультат.Очистить();
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
КонецПроцедуры

#КонецЕсли
